XXSHUB/Open_Source_Yu_STM32L475/.pack/Keil/STM32L4xx_DFP.2.5.0/CMSIS/Driver/MCI_STM32L4xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2020 Arm Limited (or its affiliates). All 
 * rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        28. September 2020
 * $Revision:    V1.3
 *
 * Driver:       Driver_MCI0
 * Configured:   via STM32CubeMX
 * Project:      MCI Driver for ST STM32L4xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                 Value
 *   ---------------------                 -----
 *   Connect to hardware via Driver_MCI# = 0
 * -------------------------------------------------------------------------- */


/*! \page stm32l4_mci CMSIS-Driver MCI Setup 

The CMSIS-Driver MCI requires:
  - Setup of SDIO with DMA for Rx DMA transfers.

Valid settings for various evaluation boards are listed in the table below:

Peripheral Resource     | STM32L496G-DISCO   | STM32L476G-EVAL   |
:-----------------------|:-------------------|:------------------|
SDMMC1 Mode             | <b>SD 4 bits</b>   | n/a               |

For different boards, refer to the hardware schematics to reflect correct setup values.

The STM32CubeMX configuration for STM32L496G-DISCO with steps for Pinout, Clock, and System Configuration are 
listed below. Enter the values that are marked \b bold.
   
Pinout tab
----------
  1. Configure SDIO mode
     - Peripherals \b SDMMC1: Mode=<b>SD 4 bits Wide bus</b>
          
Clock Configuration tab
-----------------------
  1. Configure SDIO Clock: "48MHz clocks (MHz)": 48
  
Configuration tab
-----------------
  1. Under Connectivity open \b SDMMC1 Configuration:
     - <b>DMA Settings</b>: setup DMA transfers for Rx\n
       \b Add - Select \b SDMMC1_RX: Stream=DMA2 Channel 5, Direction=Peripheral to Memory, Priority=Low
       \b Add - Select \b SDMMC1_TX: Stream=DMA2 Channel 4, Direction=Memory to Peripheral, Priority=Low

     - <b>GPIO Settings</b>: review settings, no changes required
          Pin Name | Signal on Pin | GPIO mode | GPIO Pull-up/Pull..| Maximum out | User Label
          :--------|:--------------|:----------|:-------------------|:------------|:----------
          PC8      | SDMMC1_D0     | Alternate | No pull-up and no..| Very High   |.
          PC9      | SDMMC1_D1     | Alternate | No pull-up and no..| Very High   |.
          PC10     | SDMMC1_D2     | Alternate | No pull-up and no..| Very High   |.
          PC11     | SDMMC1_D3     | Alternate | No pull-up and no..| Very High   |.
          PC12     | SDMMC1_CK     | Alternate | No pull-up and no..| Very High   |.
          PD2      | SDMMC1_CMD    | Alternate | No pull-up and no..| Very High   |.

     - <b>NVIC Settings</b>: enable interrupts
          Interrupt Table                      | Enable | Preemption Priority | Sub Priority
          :------------------------------------|:-------|:--------------------|:--------------
          SDMMC1 global interrupt              |\b ON   | 0                   | 0
          DMA2 channel5 global interrupt       |   ON   | 0                   | 0
          DMA2 channel4 global interrupt       |   ON   | 0                   | 0

     - Parameter Settings: not used
     - User Constants: not used
     - Click \b OK to close the SDIO Configuration dialog

  2. Under System open \b NVIC Configuration:
     - Disable generation of SDMMC1 interrupt handler	 
     - Click \b OK to close the NVIC Configuration dialog

  3. Open <b>Project - Settings - Advanced Settings</b> from the menu and enable "Not Generate Function call" for 
     MX_SDMMC1_SD_Init
*/

/* History:
 *  Version 1.3
 *    Replaced empty delay loops with _NOP()
 *  Version 1.2
 *    Added handling for separate SD and MMC HAL layers
 *  Version 1.1
 *    Added DMA support for Transmit
 *  Version 1.0
 *    Initial release
 */

#include "MCI_STM32L4xx.h"
#include "stm32L4xx_ll_dma.h"

#define ARM_MCI_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,3)  /* driver version */

/* Enable High Speed bus mode */
#if defined(MemoryCard_Bus_Mode_HS_Enable)
  #define MCI_BUS_MODE_HS     1U
#else
  #define MCI_BUS_MODE_HS     0U
#endif

/* Define Card Detect pin active state */
#if !defined(MemoryCard_CD_Pin_Active)
  #define MemoryCard_CD_Pin_Active GPIO_PIN_RESET
#endif

/* Define Write Protect pin active state */
#if !defined(MemoryCard_WP_Pin_Active)
  #define MemoryCard_WP_Pin_Active GPIO_PIN_SET
#endif

/* Define MemoryCard_MMC0 if SDMMC1 is configured for MMC device */
#if !defined(MemoryCard_MMC0)
  #define MCI0_HANDLE_TYPE    0U
#else
  #define MCI0_HANDLE_TYPE    1U
#endif

#if (MCI0_HANDLE_TYPE == 0)
#define MCI0_HANDLE      hsd1
extern SD_HandleTypeDef  hsd1;
#else
#define MCI0_HANDLE      hmmc1
extern MMC_HandleTypeDef hmmc1;
#endif
extern DMA_HandleTypeDef hdma_sdmmc1_rx;
extern DMA_HandleTypeDef hdma_sdmmc1_tx;

static MCI_INFO MCI;

/* DMA callback function */
static void RX_DMA_Complete(struct __DMA_HandleTypeDef *hdma);

/* IRQ Handler prototype */
void SDMMC1_IRQHandler (void);


/* Driver Version */
static const ARM_DRIVER_VERSION DriverVersion = {
  ARM_MCI_API_VERSION,
  ARM_MCI_DRV_VERSION
};

/* Driver Capabilities */
static const ARM_MCI_CAPABILITIES DriverCapabilities = {
  MCI_CD_PIN,                                     /* cd_state          */
  0U,                                             /* cd_event          */
  MCI_WP_PIN,                                     /* wp_state          */
  0U,                                             /* vdd               */
  0U,                                             /* vdd_1v8           */
  0U,                                             /* vccq              */
  0U,                                             /* vccq_1v8          */
  0U,                                             /* vccq_1v2          */
  MCI_BUS_WIDTH_4,                                /* data_width_4      */
  MCI_BUS_WIDTH_8,                                /* data_width_8      */
  0U,                                             /* data_width_4_ddr  */
  0U,                                             /* data_width_8_ddr  */
  MCI_BUS_MODE_HS,                                /* high_speed        */
  0U,                                             /* uhs_signaling     */
  0U,                                             /* uhs_tuning        */
  0U,                                             /* uhs_sdr50         */
  0U,                                             /* uhs_sdr104        */
  0U,                                             /* uhs_ddr50         */
  0U,                                             /* uhs_driver_type_a */
  0U,                                             /* uhs_driver_type_c */
  0U,                                             /* uhs_driver_type_d */
  1U,                                             /* sdio_interrupt    */
  1U,                                             /* read_wait         */
  0U,                                             /* suspend_resume    */
  0U,                                             /* mmc_interrupt     */
  0U,                                             /* mmc_boot          */
  0U,                                             /* rst_n             */
  0U,                                             /* ccs               */
  0U                                              /* ccs_timeout       */
#if (defined(ARM_MCI_API_VERSION) && (ARM_MCI_API_VERSION >= 0x203U))
, 0U                                              /* reserved bits     */
#endif
};

/**
  \fn          void Assign_SDMMC_Instance (uint32_t set)
  \brief       Set/Reset instance variable inside HAL handle structure
*/
static void Assign_SDMMC_Instance (uint32_t set) {
#if defined(MX_SDMMC1)
  #if (MCI0_HANDLE_TYPE == 0)
    /* Instance is the coresponding peripheral register inteface */
    if (set == 0) {
      hsd1.Instance = NULL;
    } else {
      hsd1.Instance = SDMMC1;
    }
  #else
    /* Instance is the coresponding peripheral register inteface */
    if (set == 0) {
      hmmc1.Instance = NULL;
    } else {
      hmmc1.Instance = SDMMC1;
    }
  #endif
#endif
}

/**
  \fn          void Config_SDMMC_Msp (uint32_t init)
  \brief       Init/DeInit MSP layer
*/
static void Config_SDMMC_Msp (uint32_t init) {
#if defined(MX_SDMMC1)
  #if (MCI0_HANDLE_TYPE == 0)
    if (hsd1.Instance != NULL) {
      if (init == 0) {
        HAL_SD_MspDeInit (&hsd1);
      } else {
        HAL_SD_MspInit (&hsd1);
      }
    }
  #else
    if (hmmc1.Instance != NULL) {
      if (init == 0) {
        HAL_MMC_MspDeInit (&hmmc1);
      } else {
        HAL_MMC_MspInit (&hmmc1);
      }
    }
  #endif
#endif
}

/**
  \fn          ARM_DRV_VERSION GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRV_VERSION
*/
static ARM_DRIVER_VERSION GetVersion (void) {
  return DriverVersion;
}


/**
  \fn          ARM_MCI_CAPABILITIES MCI_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_MCI_CAPABILITIES
*/
static ARM_MCI_CAPABILITIES GetCapabilities (void) {
  return DriverCapabilities;
}


/**
  \fn            int32_t Initialize (ARM_MCI_SignalEvent_t cb_event)
  \brief         Initialize the Memory Card Interface
  \param[in]     cb_event  Pointer to \ref ARM_MCI_SignalEvent
  \return        \ref execution_status
*/
static int32_t Initialize (ARM_MCI_SignalEvent_t cb_event) {

  if (MCI.flags & MCI_INIT) { return ARM_DRIVER_OK; }

